       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG02.
       AUTHOR. Felipe.
       INSTALLATION.  where.
       DATE-WRITTEN.  01/10/2025.
       DATE-COMPILED. 01/10/2025.
       SECURITY.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. pc.
       OBJECT-COMPUTER. pc.
       SPECIAL-NAMES.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       DATA DIVISION.
        FILE SECTION.
        WORKING-STORAGE SECTION.
       77 NUMERO-1    PIC 9(2).
       77 NUMERO-2    PIC 9(2).
       77 RESULTADO   PIC 9(3).
        LINKAGE SECTION.
       PROCEDURE DIVISION.
       ENTRADA.
           DISPLAY "DIGITE O 1. NUMERO:" AT 0101.
           ACCEPT NUMERO-1 AT 0120.
           DISPLAY "DIGITE O 2. NUMERO:" AT 0301.
           ACCEPT NUMERO-2 AT 0320.
       CALCULO.
           COMPUTE RESULTADO=NUMERO-1 + NUMERO-2.
       SAIDA.
           DISPLAY FUNCTION CONCATENATE ("A SOMA E ", RESULTADO) AT 0501.
           ACCEPT OMITTED AT 0601.
           STOP RUN.
       END PROGRAM PROG02.
