       IDENTIFICATION DIVISION.
       PROGRAM-ID. prog04.
       AUTHOR. .
       INSTALLATION.  where.
       DATE-WRITTEN.  02/10/2025.
       DATE-COMPILED. 02/10/2025.
       SECURITY.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. pc.
       OBJECT-COMPUTER. pc.
       SPECIAL-NAMES.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       DATA DIVISION.
        FILE SECTION.
        WORKING-STORAGE SECTION.
        LINKAGE SECTION.
       PROCEDURE DIVISION.
       PROGRAMA.
           DISPLAY "DIGITE A IDADE:" FOREGROUND-COLOR 4 HIGHLIGHT
            AT 0301.

        main-processing SECTION.
         mainline-paragraph.
             
             STOP RUN.
